BitNibble/Atmega_32U4/atmega32U4_blink/Atmega32U4_1/Library/atmega32U4_register.h
/********************************************************************
	ATMEGA 32U4 REGISTER
Author:   <sergio.salazar.santos@gmail.com>
License:  GNU General Public License
Hardware: Atmega32U4
Date:     26092025
********************************************************************/
#ifndef _ATMEGA32U4_REGISTER_H_
	#define _ATMEGA32U4_REGISTER_H_

/*** Library ***/
#include <stdint.h>
#include <inttypes.h>
#include <stddef.h>

/*** Base Typedef ***/
typedef union {
	struct { 
		uint8_t bit0:1,bit1:1,bit2:1,bit3:1,bit4:1,bit5:1,bit6:1,bit7:1; 
	} par;
	uint8_t var;
} U_byte;

typedef union {
	struct{
		U_byte l, h;
	} par;
	uint16_t var;
} U_word;

/*** REGISTER ***/
// 0x20 - Reserved
// 0x21 - Reserved
// 0x22 - Reserved
// 0x23 - PINB (U_byte)
typedef U_byte PINB_type;
// 0x24 - DDRB (U_byte)
typedef U_byte DDRB_type;
// 0x25 - PORTB (U_byte)
typedef U_byte PORTB_type;
// 0x26 - PINC (U_byte)
typedef U_byte PINC_type;
// 0x27 - DDRC (U_byte)
typedef U_byte DDRC_type;
// 0x28 - PORTC (U_byte)
typedef U_byte PORTC_type;
// 0x29 - PIND (U_byte)
typedef U_byte PIND_type;
// 0x2A - DDRD (U_byte)
typedef U_byte DDRD_type;
// 0x2B - PORTD (U_byte)
typedef U_byte PORTD_type;
// 0x2C - PINE (U_byte)
typedef U_byte PINE_type;
// 0x2D - DDRE (U_byte)
typedef U_byte DDRE_type;
// 0x2E - PORTE (U_byte)
typedef U_byte PORTE_type;
// 0x2F - PINF (U_byte)
typedef U_byte PINF_type;
// 0x30 - DDRF (U_byte)
typedef U_byte DDRF_type;
// 0x31 - PORTF (U_byte)
typedef U_byte PORTF_type;
// 0x32 - Reserved
// 0x33 - Reserved
// 0x34 - Reserved
// 0x35 - TIFR0 (Timer/Counter0 Interrupt Flag Register)
typedef union {
	struct {
		uint8_t tov0 : 1;
		uint8_t ocf0a : 1;
		uint8_t ocf0b : 1;
		uint8_t       : 5;
	} par;
	uint8_t var;
} TIFR0_type;
// 0x36 - TIFR1 (Timer/Counter1 Interrupt Flag Register)
typedef union {
	struct {
		uint8_t tov1 : 1;
		uint8_t ocf1a : 1;
		uint8_t ocf1b : 1;
		uint8_t ocf1c : 1;
		uint8_t       : 1;
		uint8_t icf1 : 1;
		uint8_t      : 2;
	} par;
	uint8_t var;
} TIFR1_type;
// 0x37 - Reserved
// 0x38 - TIFR3 (Timer/Counter3 Interrupt Flag Register)
typedef union {
	struct {
		uint8_t tov3 : 1;
		uint8_t ocf3a : 1;
		uint8_t ocf3b : 1;
		uint8_t ocf3c : 1;
		uint8_t       : 1;
		uint8_t icf3 : 1;
		uint8_t      : 2;
	} par;
	uint8_t var;
} TIFR3_type;
// 0x39 - TIFR4 (Timer/Counter4 Interrupt Flag Register)
typedef union {
	struct {
		uint8_t      : 2;
		uint8_t tov4 : 1;
		uint8_t      : 2;
		uint8_t ocf4b : 1;
		uint8_t ocf4a : 1;
		uint8_t ocf4d : 1;
	} par;
	uint8_t var;
} TIFR4_type;
// 0x3A - Reserved
// 0x3B - PCIFR (Pin Change Interrupt Flag Register)
typedef union {
	struct {
		uint8_t pcif0 : 1;
		uint8_t       : 7;
	} par;
	uint8_t var;
} PCIFR_type;
// 0x3C - EIFR (External Interrupt Flag Register)
typedef union {
	struct {
		uint8_t intf0 : 1;
		uint8_t intf1 : 1;
		uint8_t intf2 : 1;
		uint8_t intf3 : 1;
		uint8_t       : 2;
		uint8_t intf6 : 1;
		uint8_t       : 1;
	} par;
	uint8_t var;
} EIFR_type;
// 0x3D - EIMSK (External Interrupt Mask Register)
typedef union {
	struct {
		uint8_t int0 : 1;
		uint8_t int1 : 1;
		uint8_t int2 : 1;
		uint8_t int3 : 1;
		uint8_t      : 2;
		uint8_t int6 : 1;
		uint8_t      : 1;
	} par;
	uint8_t var;
} EIMSK_type;
// 0x3E - GPIOR0 (General Purpose IO Register 0) (U_byte)
typedef U_byte GPIOR0_type;
// 0x3F - EECR (EEPROM Control Register)
typedef union {
	struct {
		uint8_t eere : 1;
		uint8_t eepe : 1;
		uint8_t eempe : 1;
		uint8_t eerie : 1;
		uint8_t eepm0 : 1;
		uint8_t eepm1 : 1;
		uint8_t       : 2;
	} par;
	uint8_t var;
} EECR_type;
// 0x40 - EEDR (EEPROM Data Register) (U_byte)
typedef U_byte EEDR_type;



// 0x41 - EEARL (EEPROM Address Register Low) (U_byte)
typedef U_byte EEARL_type;
// 0x42 - EEARH (EEPROM Address Register High) (U_byte)
typedef union {
	struct {
		uint8_t eearh : 4;
		uint8_t       : 4;
	} par;
	uint8_t var;
} EEARH_type;
// EEAR (EEPROM Address Register)
typedef union {
	struct {
		EEARL_type l;
		EEARH_type h;
	} par;
	uint16_t var;
} EEAR_type;



// 0x43 - GTCCR (General Timer/Counter Control Register)
typedef union {
	struct {
		uint8_t psrsync : 1;
		uint8_t psrasy : 1;
		uint8_t     : 5;
		uint8_t tsm : 1;
	} par;
	uint8_t var;
} GTCCR_type;
// 0x44 - TCCR0A (Timer/Counter0 Control Register A)
typedef union {
    struct {
        uint8_t wgm00 : 1;
        uint8_t wgm01 : 1;
		uint8_t       : 2;
        uint8_t com0b0 : 1;
        uint8_t com0b1 : 1;
        uint8_t com0a0 : 1;
        uint8_t com0a1 : 1;
    } par;
    uint8_t var;
} TCCR0A_type;
// 0x45 - TCCR0B (Timer/Counter0 Control Register B)
typedef union {
    struct {
        uint8_t cs0 : 3;
        uint8_t wgm02 : 1;
		uint8_t       : 2;
        uint8_t foc0b : 1;
        uint8_t foc0a : 1;
    } par;
    uint8_t var;
} TCCR0B_type;
// 0x46 - TCNT0 (Timer/Counter0) (U_byte)
typedef U_byte TCNT0_type;
// 0x47 - OCR0A (Output Compare Register 0 A) (U_byte)
typedef U_byte OCR0A_type;
// 0x48 - OCR0B (Output Compare Register 0 B) (U_byte)
typedef U_byte OCR0B_type;
// 0x49 - PLLCSR (PLL Control and Status Register)
typedef union {
	struct {
		uint8_t plock : 1;
		uint8_t plle  : 1;
		uint8_t       : 2;
		uint8_t pindiv : 1;
		uint8_t        : 3;
	} par;
	uint8_t var;
} PLLCSR_type;
// 0x4A - GPIOR1 (General Purpose I/O Register 1) (U_byte)
typedef U_byte GPIOR1_type;
// 0x4B - GPIOR2 (General Purpose I/O Register 2) (U_byte)
typedef U_byte GPIOR2_type;
// 0x4C - SPCR (SPI Control Register)
typedef union {
	struct {
		uint8_t spr0 : 1;
		uint8_t spr1 : 1;
		uint8_t cpha : 1;
		uint8_t cpol : 1;
		uint8_t mstr : 1;
		uint8_t dord : 1;
		uint8_t spe : 1;
		uint8_t spie : 1;
	} par;
	uint8_t var;
} SPCR_type;
// 0x4D - SPSR (SPI Status Register)
typedef union {
	struct {
		uint8_t spi2x : 1;
		uint8_t       : 5;
		uint8_t wcol : 1;
		uint8_t spif : 1;
	} par;
	uint8_t var;
} SPSR_type;
// 0x4E - SPDR (SPI Data Register) (U_byte)
typedef U_byte SPDR_type;
// 0x4F - Reserved
// 0x50 - ACSR (Analog Comparator Control and Status Register)
typedef union {
	struct {
		uint8_t acis0 : 1;
		uint8_t acis1 : 1;
		uint8_t acic : 1;
		uint8_t acie : 1;
		uint8_t aci : 1;
		uint8_t aco : 1;
		uint8_t acbg : 1;
		uint8_t acd : 1;
	} par;
	uint8_t var;
} ACSR_type;
// 0x51 - OCDR (On-chip Debug Register) (U_byte)
typedef union {
	struct {
		uint8_t ocdr0 : 1;
		uint8_t ocdr1 : 1;
		uint8_t ocdr2 : 1;
		uint8_t ocdr3 : 1;
		uint8_t ocdr4 : 1;
		uint8_t ocdr5 : 1;
		uint8_t ocdr6 : 1;
		uint8_t ocdr7 : 1;
	} par;
	uint8_t var;
} OCDR_type;
// 0x52 - PLLFRQ (PLL Frequency Control Register)
typedef union {
	struct {
		uint8_t pdiv0 : 4;
		uint8_t plltm : 2;
		uint8_t pllusb : 1;
		uint8_t pinmux : 1;
	} par;
	uint8_t var;
} PLLFRQ_type;
