BitNibble/Atmega_32U4/atmega32U4_blink/Atmega32U4_1/Library/atmega32U4_register.h
// 0x53 - SMCR (Sleep Mode Control Register)
typedef union {
	struct {
		uint8_t se : 1;
		uint8_t sm : 3;
		uint8_t    : 4;
	} par;
	uint8_t var;
} SMCR_type;
// 0x54 - MCUSR (MCU Status Register)
typedef union {
	struct {
		uint8_t porf : 1;
		uint8_t extrf : 1;
		uint8_t borf : 1;
		uint8_t wdrf : 1;
		uint8_t jtrf : 1;
		uint8_t usbrf : 1;
		uint8_t       : 2;
	} par;
	uint8_t var;
} MCUSR_type;
// 0x55 - MCUCR (MCU Control Register)
typedef union {
	struct {
		uint8_t ivce : 1;
		uint8_t ivsel : 1;
		uint8_t : 2;
		uint8_t pud : 1;
		uint8_t : 2;
		uint8_t jtd : 1;
	} par;
	uint8_t var;
} MCUCR_type;
// 0x56 - Reserved
// 0x57 - SPMCSR
typedef union {
	struct {
		uint8_t spmen : 1;
		uint8_t pgers : 1;
		uint8_t pgwrt : 1;
		uint8_t blbset : 1;
		uint8_t rwwsre : 1;
		uint8_t sigrd : 1;
		uint8_t rwwsb : 1;
		uint8_t spmie : 1;
	} par;
	uint8_t var;
} SPMCSR_type;
// 0x58 - Reserved
// 0x59 - Reserved
// 0x5A - Reserved
// 0x5B - RAMPZ
typedef union {
	struct {
		uint8_t rampz0 : 1;
		uint8_t rampz1 : 1;
		uint8_t        : 6;
	} par;
	uint8_t var;
} RAMPZ_type;
// 0x5C - Reserved



// 0x5D - SPL (Stack Pointer Low Byte) (U_byte)
typedef U_byte SPL_type;
// 0x5E - SPH (Stack Pointer High Byte) (U_byte)
typedef U_byte SPH_type;
// SP (Stack Pointer)
typedef U_word SP_type;



// 0x5F - SREG (Status Register)
typedef union {
	struct {
		uint8_t c : 1;
		uint8_t z : 1;
		uint8_t n : 1;
		uint8_t v : 1;
		uint8_t s : 1;
		uint8_t h : 1;
		uint8_t t : 1;
		uint8_t i : 1;
	} par;
	uint8_t var;
} SREG_type;
// 0x60 - WDTCSR
typedef union {
	struct {
		uint8_t wdp0 : 1;
		uint8_t wdp1 : 1;
		uint8_t wdp2 : 1;
		uint8_t wde : 1;
		uint8_t wdce : 1;
		uint8_t wdp3 : 1;
		uint8_t wdie : 1;
		uint8_t wdif : 1;
	} par;
	uint8_t var;
} WDTCSR_type;
// 0x61 - CLKPR
typedef union {
	struct {
		uint8_t clkps : 4;
		uint8_t       : 3;
		uint8_t clkpce : 1;
	} par;
	uint8_t var;
} CLKPR_type;
// 0x62 - Reserved
// 0x63 - Reserved
// 0x64 - PRR0
typedef union {
	struct {
		uint8_t pradc : 1;
		uint8_t       : 1;
		uint8_t prspi : 1;
		uint8_t prtim1 : 1;
		uint8_t        : 1;
		uint8_t prtim0 : 1;
		uint8_t        : 1;
		uint8_t prtwi : 1;
	} par;
	uint8_t var;
} PRR0_type;
// 0x65 - PRR1
typedef union {
	struct {
		uint8_t prusart1 : 1;
		uint8_t          : 2;
		uint8_t prtim3 : 1;
		uint8_t prtim4 : 1;
		uint8_t        : 2;
		uint8_t prusb : 1;
	} par;
	uint8_t var;
} PRR1_type;
// 0x66 - OSCAL (U_byte)
typedef U_byte OSCAL_type;
// 0x67 - RCCTRL
typedef union {
	struct {
		uint8_t rcfreq : 1;
		uint8_t        : 7;
	} par;
	uint8_t var;
} RCCTRL_type;
// 0x68 - PCICR
typedef union {
	struct {
		uint8_t pcie0 : 1;
		uint8_t       : 7;
	} par;
	uint8_t var;
} PCICR_type;
// 0x69 - EICRA
typedef union {
	struct {
		uint8_t isc0 : 2;
		uint8_t isc1 : 2;
		uint8_t isc2 : 2;
		uint8_t isc3 : 2;
	} par;
	uint8_t var;
} EICRA_type;
// 0x6A - EICRB
typedef union {
	struct {
		uint8_t      : 4;
		uint8_t isc6 : 2;
		uint8_t      : 2;
	} par;
	uint8_t var;
} EICRB_type;
// 0x6B - PCMSK0
typedef union {
	struct {
		uint8_t pcint0 : 1;
		uint8_t pcint1 : 1;
		uint8_t pcint2 : 1;
		uint8_t pcint3 : 1;
		uint8_t pcint4 : 1;
		uint8_t pcint5 : 1;
		uint8_t pcint6 : 1;
		uint8_t pcint7 : 1;
	} par;
	uint8_t var;
} PCMSK0_type;
// 0x6C - Reserved
// 0x6D - Reserved
// 0x6E - TIMSK0 (Timer/Counter0 Interrupt Mask Register)
typedef union {
	struct {
		uint8_t toie0 : 1;
		uint8_t ocie0a : 1;
		uint8_t ocie0b : 1;
		uint8_t        : 5;
	} par;
	uint8_t var;
} TIMSK0_type;
// 0x6F - TIMSK1 (Timer/Counter1 Interrupt Mask Register)
typedef union {
	struct {
		uint8_t toie1 : 1;
		uint8_t ocie1a : 1;
		uint8_t ocie1b : 1;
		uint8_t ocie1c : 1;
		uint8_t        : 1;
		uint8_t icie1 : 1;
		uint8_t       : 2;
	} par;
	uint8_t var;
} TIMSK1_type;
// 0x70 - Reserved
// 0x71 - TIMSK3 (Timer/Counter3 Interrupt Mask Register)
typedef union {
	struct {
		uint8_t toie3 : 1;
		uint8_t ocie3a : 1;
		uint8_t ocie3b : 1;
		uint8_t ocie3c : 1;
		uint8_t        : 1;
		uint8_t icie3 : 1;
		uint8_t       : 2;
	} par;
	uint8_t var;
} TIMSK3_type;
// 0x72 - TIMSK4 (Timer/Counter4 Interrupt Mask Register)
typedef union {
	struct {
		uint8_t       : 2;
		uint8_t toie4 : 1;
		uint8_t       : 2;
		uint8_t ocie4b : 1;
		uint8_t ocie4a : 1;
		uint8_t ocie4d : 1;
	} par;
	uint8_t var;
} TIMSK4_type;
// 0x73 - Reserved
// 0x74 - Reserved
// 0x75 - Reserved
// 0x76 - Reserved
// 0x77 - Reserved



// 0x78 - ADCL (ADC Data Register Low byte) (U_byte)
typedef U_byte ADCL_type;
// 0x79 - ADCH (ADC Data Register High byte) (U_byte)
typedef U_byte ADCH_type;
// ADC (ADC Data Register)
typedef U_word ADC_type;



// 0x7A - ADCSRA (ADC Control and Status Register A)
typedef union {
	struct {
		uint8_t adps : 3;
		uint8_t adie : 1;
		uint8_t adif : 1;
		uint8_t adate : 1;
		uint8_t adsc : 1;
		uint8_t aden : 1;
	} par;
	uint8_t var;
} ADCSRA_type;
// 0x7B - ADCSRB (ADC Control and Status Register B)
typedef union {
	struct {
		uint8_t adts : 4;
		uint8_t      : 1;
		uint8_t mux5 : 5;
		uint8_t acme : 1;
		uint8_t adhsm : 1;
	} par;
	uint8_t var;
} ADCSRB_type;
// 0x7C - ADMUX (ADC Multiplexer Selection Register)
typedef union {
	struct {
		uint8_t mux0 : 1;
		uint8_t mux1 : 1;
		uint8_t mux2 : 1;
		uint8_t mux3 : 1;
		uint8_t mux4 : 1;
		uint8_t adlar : 1;
		uint8_t refs : 2;
	} par;
	uint8_t var;
} ADMUX_type;
// 0x7D - DIDR2 (Digital Input Disable Register 2)
typedef union {
	struct {
		uint8_t adc8d : 1;
		uint8_t adc9d : 1;
		uint8_t adc10d : 1;
		uint8_t adc11d : 1;
		uint8_t adc12d : 1;
		uint8_t adc13d : 1;
		uint8_t        : 2;
	} par;
	uint8_t var;
} DIDR2_type;
// 0x7E - DIDR0 (Digital Input Disable Register 0)
typedef union {
	struct {
		uint8_t adc0d : 1;
		uint8_t adc1d : 1;
		uint8_t       : 2;
		uint8_t adc4d : 1;
		uint8_t adc5d : 1;
		uint8_t adc6d : 1;
		uint8_t adc7d : 1;
	} par;
	uint8_t var;
} DIDR0_type;
// 0x7F - DIDR1 (Digital Input Disable Register 1)
typedef union {
	struct {
		uint8_t ain0d : 1;
		uint8_t       : 7;
	} par;
	uint8_t var;
} DIDR1_type;
// 0x80 - TCCR1A (Timer/Counter1 Control Register A)
typedef union {
	struct {
		uint8_t wgm10 : 1;
		uint8_t wgm11 : 1;
		uint8_t com1c0 : 1;
		uint8_t com1c1 : 1;
		uint8_t com1b0 : 1;
		uint8_t com1b1 : 1;
		uint8_t com1a0 : 1;
		uint8_t com1a1 : 1;
	} par;
	uint8_t var;
} TCCR1A_type;
// 0x81 - TCCR1B (Timer/Counter1 Control Register B)
typedef union {
	struct {
		uint8_t cs1 : 3;
		uint8_t wgm12 : 1;
		uint8_t wgm13 : 1;
		uint8_t       : 1;
		uint8_t ices1 : 1;
		uint8_t icnc1 : 1;
	} par;
	uint8_t var;
} TCCR1B_type;
