BitNibble/Atmega_32U4/atmega32U4_blink/Atmega32U4_1/Library/atmega32U4_register.h
// 0x82 - TCCR1C (Timer/Counter1 Control Register C)
typedef union {
	struct {
		uint8_t       : 5;
		uint8_t foc1c : 1;
		uint8_t foc1b : 1;
		uint8_t foc1a : 1;
	} par;
	uint8_t var;
} TCCR1C_type;
// 0x83 - Reserved



// 0x84 - TCNT1L (Timer/Counter1 Low byte) (U_byte)
typedef U_byte TCNT1L_type;
// 0x85 - TCNT1H (Timer/Counter1 High byte) (U_byte)
typedef U_byte TCNT1H_type;
// TCNT1 (Timer/Counter1)
typedef U_word TCNT1_type;



// 0x86 - ICR1L (Input Capture Register 1 Low byte) (U_byte)
typedef U_byte ICR1L_type;
// 0x87 - ICR1H (Input Capture Register 1 High byte) (U_byte)
typedef U_byte ICR1H_type;
// ICR1 (Input Capture Register 1)
typedef U_word ICR1_type;



// 0x88 - OCR1AL (Output Compare Register 1 A Low byte) (U_byte)
typedef U_byte OCR1AL_type;
// 0x89 - OCR1AH (Output Compare Register 1 A High byte) (U_byte)
typedef U_byte OCR1AH_type;
// OCR1A (Output Compare Register 1 A)
typedef U_word OCR1A_type;



// 0x8A - OCR1BL (Output Compare Register 1 B Low byte) (U_byte)
typedef U_byte OCR1BL_type;
// 0x8B - OCR1BH (Output Compare Register 1 B High byte) (U_byte)
typedef U_byte OCR1BH_type;
// OCR1B (Output Compare Register 1 B)
typedef U_word OCR1B_type;



// 0x8C - OCR1CL (Output Compare Register 1 C Low byte) (U_byte)
typedef U_byte OCR1CL_type;
// 0x8D - OCR1CH (Output Compare Register 1 C High byte) (U_byte)
typedef U_byte OCR1CH_type;
// OCR1C (Output Compare Register 1 C)
typedef U_word OCR1C_type;



// 0x8E - Reserved
// 0x8F - Reserved
// 0x90 - TCCR3A (Timer/Counter3 Control Register A)
typedef union {
	struct {
		uint8_t wgm30 : 1;
		uint8_t wgm31 : 1;
		uint8_t com3c0 : 1;
		uint8_t com3c1 : 1;
		uint8_t com3b0 : 1;
		uint8_t com3b1 : 1;
		uint8_t com3a0 : 1;
		uint8_t com3a1 : 1;
	} par;
	uint8_t var;
} TCCR3A_type;
// 0x91 - TCCR3B (Timer/Counter3 Control Register B)
typedef union {
	struct {
		uint8_t cs3 : 3;
		uint8_t wgm32 : 1;
		uint8_t wgm33 : 1;
		uint8_t       : 1;
		uint8_t ices3 : 1;
		uint8_t icnc3 : 1;
	} par;
	uint8_t var;
} TCCR3B_type;
// 0x92 - TCCR3C (Timer/Counter3 Control Register C)
typedef union {
	struct {
		uint8_t foc3a : 1;
		uint8_t       : 7;
	} par;
	uint8_t var;
} TCCR3C_type;
// 0x93 - Reserved



// 0x94 - TCNT3L (Timer/Counter3 Low byte) (U_byte)
typedef U_byte TCNT3L_type;
// 0x95 - TCNT3H (Timer/Counter3 High byte) (U_byte)
typedef U_byte TCNT3H_type;
// TCNT3H (Timer/Counter3)
typedef U_word TCNT3_type;



// 0x96 - ICR3L (Input Capture Register 3 Low byte) (U_byte)
typedef U_byte ICR3L_type;
// 0x97 - ICR3H (Input Capture Register 3 High byte) (U_byte)
typedef U_byte ICR3H_type;
// ICR3 (Input Capture Register 3)
typedef U_word ICR3_type;



// 0x98 - OCR3AL (Output Compare Register 3 A Low byte) (U_byte)
typedef U_byte OCR3AL_type;
// 0x99 - OCR3AH (Output Compare Register 3 A High byte) (U_byte)
typedef U_byte OCR3AH_type;
// OCR3A (Output Compare Register 3 A)
typedef U_word OCR3A_type;



// 0x9A - OCR3BL (Output Compare Register 3 B Low byte) (U_byte)
typedef U_byte OCR3BL_type;
// 0x9B - OCR3BH (Output Compare Register 3 B High byte) (U_byte)
typedef U_byte OCR3BH_type;
// OCR3B (Output Compare Register 3 B)
typedef U_word OCR3B_type;



// 0x9C - OCR3CL (Output Compare Register 3 C Low byte) (U_byte)
typedef U_byte OCR3CL_type;
// 0x9D - OCR3CH (Output Compare Register 3 C High byte) (U_byte)
typedef U_byte OCR3CH_type;
// OCR3C (Output Compare Register 3 C)
typedef U_word OCR3C_type;



// 0x9E - Reserved
// 0x9F - Reserved
// 0xA0 - Reserved
// 0xA1 - Reserved
// 0xA2 - Reserved
// 0xA3 - Reserved
// 0xA4 - Reserved
// 0xA5 - Reserved
// 0xA6 - Reserved
// 0xA7 - Reserved
// 0xA8 - Reserved
// 0xA9 - Reserved
// 0xAA - Reserved
// 0xAB - Reserved
// 0xAC - Reserved
// 0xAD - Reserved
// 0xAE - Reserved
// 0xAF - Reserved
// 0xB0 - Reserved
// 0xB1 - Reserved
// 0xB2 - Reserved
// 0xB3 - Reserved
// 0xB4 - Reserved
// 0xB5 - Reserved
// 0xB6 - Reserved
// 0xB7 - Reserved
// 0xB8 - TWBR (Two-Wire Serial Interface Bit Rate Register) (U_byte)
typedef U_byte TWBR_type;
// 0xB9 - TWSR (Two-Wire Serial Interface Status Register)
typedef union {
	struct {
		uint8_t twps : 2;
		uint8_t      : 1;
		uint8_t tws3 : 1;
		uint8_t tws4 : 1;
		uint8_t tws5 : 1;
		uint8_t tws6 : 1;
		uint8_t tws7 : 1;
	} par;
	uint8_t var;
} TWSR_type;
// 0xBA - TWAR (Two-Wire Serial Interface Address Register)
typedef union {
	struct {
		uint8_t twgce : 1;
		uint8_t twa   : 7;
	} par;
	uint8_t var;
} TWAR_type;
// 0xBB - TWDR (Two-Wire Serial Interface Data Register) (U_byte)
typedef U_byte TWDR_type;
// 0xBC - TWCR (Two-Wire Serial Interface Control Register)
typedef union {
	struct {
		uint8_t twie : 1;
		uint8_t      : 1;
		uint8_t twen : 1;
		uint8_t twwc : 1;
		uint8_t twsto : 1;
		uint8_t twsta : 1;
		uint8_t twea  : 1;
		uint8_t twint : 1;
	} par;
	uint8_t var;
} TWCR_type;
// 0xBD - TWAMR (Two-Wire Serial Interface Address Mask Register)
typedef union {
	struct {
		uint8_t      : 1;
		uint8_t twam : 7;
	} par;
	uint8_t var;
} TWAMR_type;



// 0xBE - TCNT4L (Timer/Counter4) (U_byte)
typedef U_byte TCNT4L_type;
// 0xBF - TCNT4H (Timer/Counter4) (U_byte)
typedef union {
	struct {
		uint8_t tc4h : 3;
		uint8_t      : 5;	
	} par;
	uint8_t var;
} TCNT4H_type;
// TCNT4 (Timer/Counter4)
typedef union {
	struct {
		TCNT4L_type l;
		TCNT4H_type h;
	} par;
	uint16_t var;	
} TCNT4_type; 



// 0xC0 - TCCR4A (Timer/Counter4 Control Register A)
typedef union {
	struct {
		uint8_t pwm4b : 1;
		uint8_t pwm4a : 1;
		uint8_t foc4b : 1;
		uint8_t foc4a : 1;
		uint8_t com4b0 : 1;
		uint8_t com4b1 : 1;
		uint8_t com4c0 : 1;
		uint8_t com4a1 : 1;
	} par;
	uint8_t var;
} TCCR4A_type;
// 0xC1 - TCCR4B (Timer/Counter4 Control Register B)
typedef union {
	struct {
		uint8_t cs4 : 4;
		uint8_t dtps4 : 2;
		uint8_t psr4 : 1;
		uint8_t pwm4x : 1;
	} par;
	uint8_t var;
} TCCR4B_type;
// 0xC2 - TCCR4C (Timer/Counter4 Control Register C)
typedef union {
	struct {
		uint8_t pwm4d : 1;
		uint8_t foc4d : 1;
		uint8_t com4d0s : 1;
		uint8_t com4d1s : 1;
		uint8_t com4b0s : 1;
		uint8_t com4b1s : 1;
		uint8_t com4a0s : 1;
		uint8_t com4a1s : 1;
	} par;
	uint8_t var;
} TCCR4C_type;
// 0xC3 - TCCR4D (Timer/Counter4 Control Register D)
typedef union {
	struct {
		uint8_t wgm4 : 2;
		uint8_t fpf4 : 1;
		uint8_t fpac4 : 1;
		uint8_t fpes4 : 1;
		uint8_t fpnc4 : 1;
		uint8_t fpen4 : 1;
		uint8_t fpie4 : 1;
	} par;
	uint8_t var;
} TCCR4D_type;
// 0xC4 - TCCR4E (Timer/Counter4 Control Register #)
typedef union {
	struct {
		uint8_t oc4oe : 6;
		uint8_t enhc4 : 1;
		uint8_t tlock4 : 1;
	} par;
	uint8_t var;
} TCCR4E_type;
// 0xC5 - CLKSEL0
typedef union {
	struct {
		uint8_t clks : 1;
		uint8_t      : 1;
		uint8_t exte : 1;
		uint8_t rce : 1;
		uint8_t exsut : 2;
		uint8_t rcsut : 2;
	} par;
	uint8_t var;
} CLKSEL0_type;
