BitNibble/Atmega_32U4/atmega32U4_blink/Atmega32U4_1/Library/atmega32U4_register.h
// 0xC6 - CLKSEL1
typedef union {
	struct {
		uint8_t excksel : 4;
		uint8_t rccksel : 4;
	} par;
	uint8_t var;
} CLKSEL1_type;
// 0xC7 - CLKSTA
typedef union {
	struct {
		uint8_t exton : 1;
		uint8_t rcon : 1;
		uint8_t      : 6;
	} par;
	uint8_t var;
} CLKSTA_type;
// 0xC8 - UCSR1A (USART Control and Status Register A)
typedef union {
    struct {
        uint8_t mpcm1 : 1;
        uint8_t u2x1  : 1;
        uint8_t pe1   : 1;
        uint8_t dor1  : 1;
        uint8_t fe1   : 1;
        uint8_t udre1 : 1;
        uint8_t txc1 : 1;
        uint8_t rxc1 : 1;
    } par;
    uint8_t var;
} UCSR1A_type;
// 0xC9 - UCSR1B (USART Control and Status Register B)
typedef union {
    struct {
        uint8_t txb81 : 1;
        uint8_t rxb81 : 1;
        uint8_t ucsz12 : 1;
        uint8_t txen1 : 1;
        uint8_t rxen1 : 1;
        uint8_t udrie1 : 1;
        uint8_t txcie1 : 1;
        uint8_t rxcie1 : 1;
    } par;
    uint8_t var;
} UCSR1B_type;
// 0xCA - UCSR1C (USART Control and Status Register C)
typedef union {
    struct {
		uint8_t ucpol1 : 1;
		uint8_t ucsz10 : 1;
		uint8_t ucsz11 : 1;
		uint8_t usbs1 : 1;
		uint8_t upm10 : 1;
		uint8_t upm11 : 1;
        uint8_t umsel10 : 1;
        uint8_t umsel11 : 1;
    } par;
    uint8_t var;
} UCSR1C_type;
// 0xCB - UCSR1D (USART Control and Status Register D)
typedef union {
	struct {
		uint8_t rtsen : 1;
		uint8_t ctsen : 1;
		uint8_t       : 6;
	} par;
	uint8_t var;
} UCSR1D_type;



// 0xCC - UBRR1L (USART Baud Rate Register Low) (U_byte)
typedef U_byte UBRR1L_type;
// 0xCD - UBRR1H (USART Baud Rate Register High) (U_byte)
typedef union {
	struct {
		uint8_t brr1h : 4;
		uint8_t       : 4;	
	} par;
	uint8_t var;	
} UBRR1H_type;
// UBRR1 (USART Baud Rate Register)
typedef union {
	struct {
		UBRR1L_type l;
		UBRR1H_type h;
	} par;
	uint16_t var;	
} UBRR1_type;



// 0xCE - UDR1 (USART I/O Data Register) (U_byte)
typedef U_byte UDR1_type;
// 0xCF - OCR4A (Output Compare Register 4 A) (U_byte)
typedef U_byte OCR4A_type;
// 0xD0 - OCR4B (Output Compare Register 4 B) (U_byte)
typedef U_byte OCR4B_type;
// 0xD1 - OCR4C (Output Compare Register 4 C) (U_byte)
typedef U_byte OCR4C_type;
// 0xD2 - OCR4D (Output Compare Register 4 D) (U_byte)
typedef U_byte OCR4D_type;
// 0xD3 - Reserved
// 0xD4 - DT4
typedef union {
	struct {
		uint8_t l : 4;
		uint8_t h : 4;
	} par;
	uint8_t var;
} DT4_type;
// 0xD5 - Reserved
// 0xD6 - Reserved
// 0xD7 - UHWCON
typedef union {
	struct {
		uint8_t uvrege : 1;
		uint8_t        : 7;
	} par;
	uint8_t var;
} UHWCON_type;
// 0xD8 - USBCON
typedef union {
	struct {
		uint8_t vbuste : 1;
		uint8_t        : 3;
		uint8_t otgpade : 1;
		uint8_t frzclk : 1;
		uint8_t        : 1;
		uint8_t usbe : 1;
	} par;
	uint8_t var;
} USBCON_type;
// 0xD9 - USBSTA
typedef union {
	struct {
		uint8_t vbus : 1;
		uint8_t id : 1;
		uint8_t    : 6;
	} par;
	uint8_t var;
} USBSTA_type;
// 0xDA - USBINT
typedef union {
	struct {
		uint8_t vbusti : 1;
		uint8_t        : 7;
	} par;
	uint8_t var;
} USBINT_type;
// 0xDB - Reserved
// 0xDC - Reserved
// 0xDD - Reserved
// 0xDE - Reserved
// 0xDF - Reserved
// 0xE0 - UDCON
typedef union {
	struct {
		uint8_t detach : 1;
		uint8_t rmwkup : 1;
		uint8_t lsm : 1;
		uint8_t rstcpu : 1;
		uint8_t        : 4;
	} par;
	uint8_t var;
} UDCON_type;
// 0xE1 - UDINT
typedef union {
	struct {
		uint8_t suspi : 1;
		uint8_t msofi : 1;
		uint8_t sofi : 1;
		uint8_t eorsti : 1;
		uint8_t wakeupi : 1;
		uint8_t eorsmi : 1;
		uint8_t uprsmi : 1;
		uint8_t        : 1;
	} par;
	uint8_t var;
} UDINT_type;
// 0xE2 - UDIEN
typedef union {
	struct {
		uint8_t suspe : 1;
		uint8_t msofe : 1;
		uint8_t sofe : 1;
		uint8_t eorste : 1;
		uint8_t wakeupe : 1;
		uint8_t eorsme : 1;
		uint8_t uprsme : 1;
		uint8_t        : 1;
	} par;
	uint8_t var;
} UDIEN_type;
// 0xE3 - UDADDR
typedef union {
	struct {
		uint8_t uadd : 7;
		uint8_t adden : 1;
	} par;
	uint8_t var;
} UDADDR_type;



// 0xE4 - UDFNUML (U_byte)
typedef U_byte UDFNUML_type;
// 0xE5 - UDFNUMH
typedef union {
	struct {
		uint8_t fnum : 3;
		uint8_t      : 5;
	} par;
	uint8_t var;
} UDFNUMH_type;
// UDFNUM
typedef union {
	struct {
		UDFNUML_type l;
		UDFNUMH_type h;
	} par;
	uint16_t var;	
} UDFNUM_type;



// 0xE6 - UDMFN
typedef union {
	struct {
		uint8_t        : 4;
		uint8_t fncerr : 1;
		uint8_t        : 3;
	} par;
	uint8_t var;
} UDMFN_type;
// 0xE7 - Reserved
// 0xE8 - UEINTX
typedef union {
	struct {
		uint8_t txini : 1;
		uint8_t stalledi : 1;
		uint8_t rxouti : 1;
		uint8_t rxstpi : 1;
		uint8_t nakouti : 1;
		uint8_t rwal : 1;
		uint8_t nakini : 1;
		uint8_t fifocon : 1;
	} par;
	uint8_t var;
} UEINTX_type;
// 0xE9 - UENUM
typedef union {
	struct {
		uint8_t epnum : 3;
		uint8_t       : 5;
	} par;
	uint8_t var;
} UENUM_type;
// 0xEA - UERST
typedef union {
	struct {
		uint8_t eprst : 7;
		uint8_t       : 1;
	} par;
	uint8_t var;
} UERST_type;
// 0xEB - UECONX
typedef union {
	struct {
		uint8_t epen : 1;
		uint8_t      : 2;
		uint8_t rstdt : 1;
		uint8_t stallrqc : 1;
		uint8_t stallrq : 1;
		uint8_t         : 2;
	} par;
	uint8_t var;
} UECONX_type;
// 0xEC - UECFG0X
typedef union {
	struct {
		uint8_t epdir : 1;
		uint8_t       : 5;
		uint8_t eptype : 2;
	} par;
	uint8_t var;
} UECFG0X_type;
// 0xED - UECFG1X
typedef union {
	struct {
		uint8_t       : 1;
		uint8_t alloc : 1;
		uint8_t epbk : 2;
		uint8_t epsize : 4;
	} par;
	uint8_t var;
} UECFG1X_type;
// 0xEE - UESTA0X
typedef union {
	struct {
		uint8_t nbusybk : 2;
		uint8_t dtseq : 2;
		uint8_t       : 1;
		uint8_t underfi : 1;
		uint8_t overfi : 1;
		uint8_t cfgok : 1;
	} par;
	uint8_t var;
} UESTA0X_type;
// 0xEF - UESTA1X
typedef union {
	struct {
		uint8_t currbk : 2;
		uint8_t ctrldir : 1;
		uint8_t reserved : 5;
	} par;
	uint8_t var;
} UESTA1X_type;
// 0xF0 - UEIENX
typedef union {
	struct {
		uint8_t txine : 1;
		uint8_t stallede : 1;
		uint8_t rxoute : 1;
		uint8_t rxstpe : 1;
		uint8_t nakoute : 1;
		uint8_t         : 1;
		uint8_t nakine : 1;
		uint8_t flerre : 1;
	} par;
	uint8_t var;
} UEIENX_type;
// 0xF1 - UEDATX (U_byte)
typedef U_byte UEDATX_type;



// 0xF2 - UEBCLX (U_byte)
typedef U_byte UEBCLX_type;
// 0xF3 - UEBCHX
typedef union {
	struct {
		uint8_t byct : 3;
		uint8_t      : 5;
	} par;
	uint8_t var;
} UEBCHX_type;
// UEBC_X
typedef union {
	struct {
		UEBCLX_type l;
		UEBCHX_type h;
	} par;
	uint16_t var;	
} UEBC_X_type;



// 0xF4 - UEINT
typedef union {
	struct {
		uint8_t epint : 7;
		uint8_t       : 1;
	} par;
	uint8_t var;
} UEINT_type;
// 0xF5 - Reserved
// 0xF6 - Reserved
// 0xF7 - Reserved
// 0xF8 - Reserved
// 0xF9 - Reserved
// 0xFA - Reserved
// 0xFB - Reserved
// 0xFC - Reserved
// 0xFD - Reserved
// 0xFE - Reserved
// 0xFF - Reserved

#endif
/*** EOF ***/

